'''Задание 1.
Выведите на экран надпись To be or not to be на разных строках. '''
print("To be \nor not \nto be")
print()

'''Выведите на экран надпись «Life is what happens when you're busy making other
plans» John Lennon на разных строках.'''
print("Life is what happens when \n\tyou’re busy making \n\t\tther plans” John Lennon.")
print()

'''Задание 3.
Определите тип данных 10 и '10'
Результат выведите на экран
'''
print(type('10'))
print(type(10))
print()

'''Задание 4.
Выведите на экран треугольник из звездочек'''
print("*")
print("**")
print("***")
print("****")
print("*****")